import React from 'react'

const Condition = () => {
  return (
    <div className='flex flex-col gap-8 h-[25rem]'>

      <div>
        <h2 className='font-bold'>همکاری با لرنیفای چگونه است؟</h2>
        <li>لرنیفای پلتفرم جامع عرضه محتوای آموزش ویدیویی شما مدرسین گرامی است،</li>
        <li>همکاری لرنیفای با مدرسین به صورت مشارکتی است و سهم مدرس ۵۰% است.</li>
        <li>لرنیفای پایبند به قوانین ضد انحصاری است.</li>
      </div>


      <div>
        <h2 className='font-bold'>ارزش گذاری دوره آموزشی چگونه است؟</h2>
        <p>ارزش گذاری دوره آموزشی بر عهدهٔ خود مدرسین است. البته درصورتی که مدرسین نیاز به راهنمایی در این خصوص داشته باشند ما مشتاق پاسخگویی هستیم، همچنین لرنیفای درصورت تشخیص ارزش‌گذاری اشتباه  بر اساس معیارهای خود این موارد را به مدرسین اطلاع می‌دهد</p>
      </div>

      <div>
        <h2 className='font-bold'>نحوه و شرایط تسویه حساب در لرنیفای است؟</h2>
        <p>تسویه حساب در لرنیفای سریع و در تمامی روزهای کاری انجام می شود. مدرس پس از ثبت درخواست دریافت وجه در پنل کاربری، واریز وجه پرداختی در همان روز کاری پیگیری و از طریق پایا به شماره حساب ثبت شده در پنل کاربری مدرس واریز می‌شود.</p>
      </div>

    </div>
  )
}

export default Condition
