import React from 'react'

const Release_period = () => {
  return (
    <div className='flex flex-col gap-8 pt-4 pb-10'>
      <li>زمانی که دوره آموزشی تان آماده شد، وارد سایت شوید و از منوی سایت روی “انتشار آموزش” بزنید. مراحل انتشار آموزش در لرنیفای بسیار ساده است.</li>
      <li>در هر مراحل از انتشار آموزش راهنما وجود دارد، که از این راهنما می توانید کمک بگیرید.</li>
      <li>نوشتن متن های کامل و دقیق به گرفتن بازخورد خوب آموزش شما کمک می‌کند و شما به عنوان یک مدرس می توانید شرح جزئیات دروره را کامل بنویسید تا پاسخگو سوالات دانشجو قبل از شرکت در دوره باشید</li>
      <li>پاسخ به سوالات مرحله سوم بسیار مهم است، سعی کنید پاسخ‌هایی دقیق به این سوالات بدهید تا دانشجویان قبل از شرکت بتوانند از جزئیات آموزش آگاه شوند.</li>
      <li>پیشنهاد ما این است که دوره هایی که کمتر از ۲ ساعت است را به صورت رایگان منتشر کنید.</li>
      <li>نکته مهم معمولا مدرسینی که چندین دوره مختلف (پولی، رایگان و تک قسمتی) در پروفایل خود  دارند، درآمد بهتری دارند.	</li>
    </div>
  )
}

export default Release_period
