import React from 'react'

const Training_recording = () => {
  return (
    <div className='flex flex-col gap-8 pt-4 pb-10'>
      <li>حتما قبل از شروع به ضبط آموزش چندین بار تمرین کنید تا مطالب را به خوبی و بدون توپق زدن انتقال بدهید، چون یکی از ویژگی‌های مهم ویدئوهای آموزشی، این است که محتوای آموزشی با سرعت و بدون فوت وقت پیش برود، پس همچینن مواردی به نصب برنامه و پیدا کردن فایلی خاص بهتر است در زمان ویرایش از آموزش حذف و یا سریع شود.</li>
      <li>یکی از مهمترین وجوه تمایز مدرسین، بیان خوب و انتقال مناسب محتوا به دانشجو است. مدرسین باید به موضوع آموزشی خود تسلط داشته باشند و بتوانند به راحتی آن را به دانشجویان خود منتقل کنند. همچنین به تلفظ صحیح کلمات فارسی و انگلیسی نیز توجه داشته باشید و سعی کنید هنگام ضبط آموزش با انرژی صحبت کنید.</li>
      <li>کیفیت صدا و تصویر آموزشتان بسیار اهمیت دارد، چون این اولین موردی است که برای دانشجویتان جلب توجه می کند، ممکن است آموزشی با محتوای عالی به خاطر نداشتن کیفیت مورد استقبال قرار نگیرد.</li>
      <li>کیفیت تصویر آموزش شما به شکلی باشد که دانشجو به سادگی بتواند جزئیات تصویر را مشاهده کند.  ترجیحا نسبت فیلم ضبط شده ۱۶:۹ و حداقل انداره ویدیو HD یعنی ۱۲۸۰*۷۲۰ باشد </li>
    </div>
  )
}

export default Training_recording
